module.exports.config = {
  name: "bby",
  version: "0.0.2",
  permission: 0,
  prefix: false,
  credits: "Islamick Cyber Chat",
  description: "fun",
  category: "admin",
  usages: "",
  cooldowns: 5,
};

module.exports.run = async function({ api, event, args, Users }) {
    const axios = require("axios");
    const request = require("request");
    const fs = require("fs-extra");
    const prompt = args.join(" ");
    var id = event.senderID;
    var name = await Users.getNameUser(event.senderID);
    var tl = ["\n- হুম বেবি বলো-!!😘😊","\n অহ আমার বেবি টা আমাকে না ডেকে-আমার বস SM Hridoy কে ডাকো!!😍❤️","\n\n- বেবি এতো ডাকো আদর দিবা!!✨🤍🤭","\nএতো বেবি বেবি করলে কোলে উঠে হিসু করে দিবো!!🙈😽","\n আমাকে বেবি না বলে এস এম হৃদয় কে বেবি বলো\n তুমার সাথে আরি-!!😌😾","\n\nবেবি তোমার ওই\n খানে উম্মা -!!🙈😛","\nতুমি আর আমার সাথে কথা বলবা না।\n তুমি কাল পাসের বাড়ির ভাবির সাথে কি করসো-!!🤬😤","\n আমাকে আর বেবি ডাকবে না..!😾\nতুমার আব্বুর কাছে নালিশ দিবো আমি..!😤\n তুমি ভাবি দের সাথে খারাপ কাজ করো তুমি লুচ্চা-!!😈😭","\nকোন সাহ্যসে তুমি আমাকে ডাকো তুমি একটা লুচ্চা-!!😈","\nতোমার আমার প্রেম!!😔\n কখনো হবে না.??","\n - হুম বাবু পরে কথা হবে এখন রাখি-!!😘😍🥹","\nবাবু শোনোনা থাক তুমি তো কানা","\n - হুম বাবু আর একটা প্রেম করবো /nতোমার সাথে পড়ে কথা বলি-!!😊😔",];
    var rand = tl[Math.floor(Math.random() * tl.length)];
    if (!prompt) return api.sendMessage(`${name}\n ${rand}`, event.threadID, event.messageID);
    const res = await axios.get(`https://www.noobs-api.000.pe/dipto/baby?text=${prompt}`);
    const respond = res.data.reply;
    return api.sendMessage( respond, event.threadID, event.messageID);
};
